src/cf/Catalogs/ПравилаЭскалации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПравилаЭскалации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСрокаПравилЭскалацииЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПравилЭскалацииЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеЭскалации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляПроцессов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбработкиВидовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Просрочка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредметаЭскалации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПредметовЭскалации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦППК_КомментарийДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеУсловия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УсловияПравилЭскалацииЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеУсловия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыВажностиОбъектов</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.АлгоритмыПроверки</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыАвторЯвляетсяПравилЭскалацииЗадач</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.УсловияЗадач</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаОбработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиОбработкиВидовОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияУчастника</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФункцииУчастниковДействий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Процессы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипПроцесса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПроцессовЭскалацииЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Согласование</v8:Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Ознакомление</v8:Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Рассмотрение</v8:Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Утверждение</v8:Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Исполнение</v8:Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Подписание</v8:Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Регистрация</v8:Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.Приглашение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонКомплексногоПроцесса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ДействияПравилЭскалацииЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДействияПравилЭскалацииЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перенаправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическоеВыполнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыПредметовЭскалации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыПредметовЭскалации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процессы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПараметрыСхемДляКомплексныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПараметрыСхемДляКомплексныхПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецСхемы</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиЭлементов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
								<v8:Type>cfg:CatalogRef.ИменаПредметов</v8:Type>
								<v8:Type>cfg:CatalogRef.СкриптыСхемДляКомплексныхПроцессов</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаХранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокСортировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПравилаЭскалации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ШаблонПроцесса")
		И ТипЗнч(ДанныеЗаполнения.ШаблонПроцесса) = Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов") Тогда
		
		НайденныеШаблоны = Новый Массив;
		ОбрабатываемыеШаблоны = Новый Массив;
		ОбрабатываемыеШаблоны.Добавить(ДанныеЗаполнения.ШаблонПроцесса);
		Пока ОбрабатываемыеШаблоны.Количество() > 0 Цикл
			
			ОбрабатываемыйШаблон = ОбрабатываемыеШаблоны[0];
			ОбрабатываемыеШаблоны.Удалить(0);
					
			СхемаШаблона =
				ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				ОбрабатываемыйШаблон, "Схема");
				
			Если ЗначениеЗаполнено(СхемаШаблона) Тогда
								
				ДанныеПараметров =
					Справочники.ПараметрыСхемДляКомплексныхПроцессов.ДанныеПараметровСхемы(
						Справочники.ПараметрыСхемДляКомплексныхПроцессов.ПараметрыПоСхеме(
							СхемаШаблона)); 
				
				ОписаниеТиповНастроек =
					Метаданные.ОпределяемыеТипы.ШаблонДействияКомплексногоПроцесса.Тип;
					
				Для Каждого ИмяЭлементаИНастройка Из ДанныеПараметров.НастройкиЭлементов Цикл
					НастройкаЭлемента = ИмяЭлементаИНастройка.Значение;
					ТипНастройки = ТипЗнч(НастройкаЭлемента);
					Если Не ОписаниеТиповНастроек.СодержитТип(ТипЗнч(НастройкаЭлемента))
						Или Не ЗначениеЗаполнено(НастройкаЭлемента) Тогда
						
						Продолжить;					
					КонецЕсли;
					Если ТипНастройки = Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов") Тогда
						ОбрабатываемыеШаблоны.Добавить(НастройкаЭлемента);
					Иначе
						НайденныеШаблоны.Добавить(НастройкаЭлемента);
					КонецЕсли;
				КонецЦикла;				
				
			Иначе
				
				Запрос = Новый Запрос(
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ШаблоныКомплексныхБизнесПроцессовЭтапы.ШаблонБизнесПроцесса
					|ИЗ
					|	Справочник.ШаблоныКомплексныхБизнесПроцессов.Этапы КАК ШаблоныКомплексныхБизнесПроцессовЭтапы
					|ГДЕ
					|	ШаблоныКомплексныхБизнесПроцессовЭтапы.Ссылка = &Ссылка");
				Запрос.УстановитьПараметр("Ссылка", ОбрабатываемыйШаблон);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Не ЗначениеЗаполнено(Выборка.ШаблонБизнесПроцесса) Тогда
						Продолжить;
					КонецЕсли;
					Если ТипЗнч(Выборка.ШаблонБизнесПроцесса) = Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов") Тогда
						ОбрабатываемыеШаблоны.Добавить(Выборка.ШаблонБизнесПроцесса);
					Иначе
						НайденныеШаблоны.Добавить(Выборка.ШаблонБизнесПроцесса);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли; 
					
		КонецЦикла;
		
		Для Каждого НайденныйШаблон Из НайденныеШаблоны Цикл
			ТипПроцесса = Перечисления.ТипыПроцессовЭскалацииЗадач.ТипПроцессаПоШаблону(
				НайденныйШаблон);
			ТочкиМаршрута = Перечисления.ТипыПроцессовЭскалацииЗадач.ТочкиМаршрутаПоТипуПроцесса(
				ТипПроцесса, Истина);
			Для Каждого ТочкаМаршрута Из ТочкиМаршрута Цикл
				НоваяСтрока = Процессы.Добавить();
				НоваяСтрока.ТипПроцесса = ТипПроцесса;
				НоваяСтрока.Шаблон = НайденныйШаблон;
				НоваяСтрока.ТочкаМаршрута = ТочкаМаршрута;
				НоваяСтрока.ШаблонКомплексногоПроцесса = ДанныеЗаполнения.ШаблонПроцесса;
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ШаблонПроцесса")
		И ТипЗнч(ДанныеЗаполнения.ШаблонПроцесса) <> Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов") Тогда
		
		ТипПроцесса = Перечисления.ТипыПроцессовЭскалацииЗадач.ТипПроцессаПоШаблону(
			ДанныеЗаполнения.ШаблонПроцесса);
		ТочкиМаршрута = Перечисления.ТипыПроцессовЭскалацииЗадач.ТочкиМаршрутаПоТипуПроцесса(
			ТипПроцесса, Истина);
		Для Каждого ТочкаМаршрута Из ТочкиМаршрута Цикл
			НоваяСтрока = Процессы.Добавить();
			НоваяСтрока.ТипПроцесса = ТипПроцесса;
			НоваяСтрока.Шаблон = ДанныеЗаполнения.ШаблонПроцесса;
			НоваяСтрока.ТочкаМаршрута = ТочкаМаршрута;
		КонецЦикла;
		
	КонецЕсли;
	
	Ответственный = Сотрудники.ОсновнойСотрудник();
	
	ДатаСоздания = ТекущаяДатаСеанса();
	
	Если НаправлениеЭскалации = Неопределено Тогда
		НаправлениеЭскалации = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИсключаемыеРеквизиты = Новый Массив;
	Если Действие <> Перечисления.ДействияПравилЭскалацииЗадач.Перенаправление Тогда
		ИсключаемыеРеквизиты.Добавить("НаправлениеЭскалации");
	КонецЕсли;
	Если Действие <> Перечисления.ДействияПравилЭскалацииЗадач.АвтоматическоеВыполнение Тогда
		ИсключаемыеРеквизиты.Добавить("ВариантВыполнения");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипПредметаЭскалации) Тогда
		ТипПредметаЭскалации = Перечисления.ТипыПредметовЭскалации.Процессы;
	КонецЕсли;
	
	Если Обработки.Количество() <> 0 Тогда
		Если ЗначениеЗаполнено(Обработки[0].НастройкаОбработки) Тогда
			НастройкаОбработки = Обработки[0].НастройкаОбработки;
		КонецЕсли;	
	КонецЕсли;		

	ОпределитьПриоритет();
	СкорректироватьТаблицуУсловий();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Сотрудники.ОсновнойСотрудник();
	ДатаСоздания = ТекущаяДатаСеанса();
	Приоритет = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Удаляет пустые строки и дубли строк из обрабатываемой табличной части.
//
Процедура СкорректироватьТаблицуУсловий()
	
	// Удаляем пустые строки.
	КоличествоЭлементов = ДополнительныеУсловия.Количество();
	Для Индекс = 1 По КоличествоЭлементов Цикл
		Строка = ДополнительныеУсловия[КоличествоЭлементов - Индекс];
		Если Не ЗначениеЗаполнено(Строка.Условие)
			Или Не ЗначениеЗаполнено(Строка.ЗначениеУсловия) Тогда
			ДополнительныеУсловия.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	// Удаляем дубли строк.
	КоличествоЭлементов = ДополнительныеУсловия.Количество();
	Для Индекс1 = 1 По КоличествоЭлементов - 1 Цикл
		Строка1 = Новый Структура("Условие, ЗначениеУсловия");
		ЗаполнитьЗначенияСвойств(Строка1, ДополнительныеУсловия[КоличествоЭлементов - Индекс1]);
		Для Индекс2 = Индекс1 + 1 По КоличествоЭлементов Цикл
			Строка2 = Новый Структура("Условие, ЗначениеУсловия");
			ЗаполнитьЗначенияСвойств(Строка2, ДополнительныеУсловия[КоличествоЭлементов - Индекс2]);
			Если Строка1.Условие = Строка2.Условие
				И Строка1.ЗначениеУсловия = Строка2.ЗначениеУсловия Тогда
				ДополнительныеУсловия.Удалить(ДополнительныеУсловия[КоличествоЭлементов - Индекс1]);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Определяет приоритет правила эскалации.
//
Процедура ОпределитьПриоритет()
	
	Если ПометкаУдаления Тогда
		Приоритет = 0;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Приоритет) Тогда
		
		Приоритет = Справочники.ПравилаЭскалации.МаксимальныйПриоритет(НастройкаОбработки) + 100;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОтключитьПроверкуУникальностиПриоритета")
		Или ПараметрыСеанса.ЗагрузкаОбработанныхДанныхИзДругойСистемы Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоСПриоритетом = Справочники.ПравилаЭскалации.ПравилоСПриоритетом(Ссылка, Приоритет);
	Если ЗначениеЗаполнено(ПравилоСПриоритетом) Тогда
		ТекстОшибки = НСтр("ru = 'Правило с таким приоритетом уже существует.
			|Нормализуйте приоритеты и повторите попытку.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
